In [124]:
import pandas as pd

In [125]:
df=pd.read_csv('Employee_Dataset.csv')

In [126]:
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,invalid,01/04/2021,5,3,NaN
1,emp_1,IT,Analyst,NaN,55000,10/06/2020,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaN,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,invalid,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaN,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,invalid,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021/07/15,invalid,3,excellent,yes
998,emp_998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,invalid,2022-03-01,ten,5,yes

# 1

In [127]:
df['joining_date'] =pd.to_datetime(df['joining_date'],dayfirst=True,errors='coerce')
count=df['joining_date'].isna().sum()
count

C:\Users\DELL\AppData\Local\Temp\ipykernel_17444\4072933124.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['joining_date'] =pd.to_datetime(df['joining_date'],dayfirst=True,errors='coerce')

np.int64(377)

# 2

In [128]:
df["employee_id"]=df["employee_id"].astype(str)
df["employee_id"]=df["employee_id"].str.strip()
df["employee_id"]=df["employee_id"].str.upper()
df["employee_id"]=df["employee_id"].str.replace("_","",regex=False)
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,NaT,01/04/2021,5,3,NaN
1,EMP1,IT,Analyst,NaN,55000,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaT,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,NaT,01/04/2021,1,3,NaN
4,NAN,IT,mgr,150,85000,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021-07-15,invalid,3,excellent,yes
998,EMP998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,NaT,2022-03-01,ten,5,yes

# 3

In [129]:
df["department"]=df["department"].str.strip()
df["department"]=df["department"].str.upper()

In [130]:
df["salary"] = df["salary"].astype(str).str.replace("₹", "", regex=False)
df["salary"] = df["salary"].str.replace(",", "", regex=False)
df["salary"] = pd.to_numeric(df["salary"], errors="coerce")

In [131]:
avg_sal=df.groupby("department")["salary"].mean()
avg_sal

department
FINANCE    107397.959184
HR         110117.647059
IT         103373.205742
SALES      110842.696629
Name: salary, dtype: float64

# 4

In [132]:
df['age']=pd.to_numeric(df['age'],errors='coerce')
df.loc[(df['age']<0),'age']=np.nan
df[(df['age'].isna()) & (df['salary'].notna())]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
1,EMP1,IT,Analyst,NaN,55000.0,2020-06-10,invalid,5,3,True
5,NAN,IT,mgr,NaN,75000.0,2019-05-10,invalid,8,3,no
10,EMP10,FINANCE,Analyst,NaN,35000.0,NaT,NaN,8,1,no
23,EMP23,FINANCE,NaN,NaN,85000.0,NaT,NaN,-2,5,NaN
30,EMP1030,HR,Manager,NaN,85000.0,2019-05-10,invalid,3,3,True
...,...,...,...,...,...,...,...,...,...,...
981,NAN,SALES,mgr,NaN,85000.0,NaT,NaN,-2,NaN,yes
982,NAN,HR,NaN,NaN,55000.0,2020-06-10,NaN,5,NaN,NaN
990,EMP990,NaN,Senior Analyst,NaN,85000.0,2019-05-10,01/04/2021,12,5,yes
991,NAN,IT,Analyst,NaN,120000.0,2020-06-10,2022-03-01,-2,4,yes
994,EMP1994,SALES,NaN,NaN,85000.0,2019-05-10,2022-03-01,12,1,True

# 6

In [134]:
df['performance_rating']=df['performance_rating'].replace({'excellent': 5,'poor':1})
df['performance_rating']=pd.to_numeric(df['performance_rating'],errors='coerce')
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60.0,85000.0,NaT,01/04/2021,5,3.0,NaN
1,EMP1,IT,Analyst,NaN,55000.0,2020-06-10,invalid,5,3.0,True
2,EMP1002,SALES,NaN,28.0,85000.0,NaT,2022-03-01,3,4.0,NaN
3,EMP1003,IT,Analyst,45.0,35000.0,NaT,01/04/2021,1,3.0,NaN
4,NAN,IT,mgr,150.0,85000.0,NaT,invalid,12,2.0,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,FINANCE,NaN,60.0,55000.0,2019-05-10,2022-03-01,1,4.0,yes
996,EMP1996,IT,Analyst,35.0,250000.0,NaT,invalid,-2,5.0,NaN
997,EMP1997,SALES,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,5.0,yes
998,EMP998,FINANCE,NaN,60.0,85000.0,2019-05-10,NaN,12,NaN,True
999,EMP1999,IT,Manager,150.0,75000.0,NaT,2022-03-01,ten,5.0,yes

# 7

In [135]:
medrating=df.groupby("designation")["performance_rating"].median()
medrating

designation
ANALYST           3.0
Analyst           3.0
Manager           3.0
Senior Analyst    3.0
mgr               3.0
Name: performance_rating, dtype: float64

# 8

In [136]:
import numpy as np
df['experience_years']=df['experience_years'].replace({'ten':10})
df['experience_years']=pd.to_numeric(df['experience_years'],errors='coerce')
df.loc[(df['experience_years']<0),'experience_years']=np.nan
df.loc[(df['experience_years']>df['age'])]

Empty DataFrame
Columns: [employee_id, department, designation, age, salary, joining_date, last_promotion_date, experience_years, performance_rating, is_active]
Index: []

# 9

In [137]:
df['designation']=df['designation'].replace({'mgr':'Manager'}).str.title()
df['is_active']=df['is_active'].replace({'yes':True,'no':False,'True':True,'False':False})
df[(df['designation'].notna()) & (df['is_active']==True)].groupby('designation')['is_active'].count()

designation
Analyst           122
Manager           150
Senior Analyst     88
Name: is_active, dtype: int64

# 10

In [138]:
df['last_promotion_date'] =pd.to_datetime(df['last_promotion_date'],errors='coerce',dayfirst=True)
df.loc[(df['last_promotion_date'].dt.year>2020) & (df['is_active']==False)]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
17,EMP17,SALES,Senior Analyst,NaN,NaN,NaT,2021-04-01,3.0,4.0,False
70,EMP1070,SALES,NaN,35.0,NaN,NaT,2021-04-01,5.0,2.0,False
71,EMP71,SALES,Manager,60.0,250000.0,2021-07-15,2021-04-01,12.0,5.0,False
79,EMP79,NaN,Manager,NaN,NaN,2019-05-10,2021-04-01,8.0,1.0,False
91,EMP91,NaN,Manager,35.0,55000.0,2020-06-10,2021-04-01,3.0,1.0,False
...,...,...,...,...,...,...,...,...,...,...
966,NAN,IT,Analyst,45.0,NaN,2020-06-10,2021-04-01,1.0,NaN,False
967,NAN,NaN,NaN,22.0,85000.0,NaT,2021-04-01,12.0,1.0,False
973,NAN,IT,NaN,60.0,NaN,NaT,2021-04-01,5.0,1.0,False
974,EMP974,NaN,Manager,NaN,85000.0,2021-07-15,2021-04-01,3.0,4.0,False
983,EMP1983,HR,Manager,150.0,NaN,NaT,2021-04-01,1.0,1.0,False

# 11

In [150]:
df["joining_date"] = pd.to_datetime(
    df["joining_date"],
    dayfirst=True,
    errors="coerce"
)
today = pd.Timestamp.today()
df["tenure_years"] = (today - df["joining_date"]).dt.days / 365
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years
0,EMP1000,IT,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5.0,3.0,NaN,NaN
1,EMP1,IT,Analyst,NaN,55000.0,2020-06-10,NaT,5.0,3.0,True,5.676712
2,EMP1002,SALES,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,NaN,NaN
3,EMP1003,IT,Analyst,45.0,35000.0,NaT,2021-04-01,1.0,3.0,NaN,NaN
4,NAN,IT,Manager,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,FINANCE,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.764384
996,EMP1996,IT,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,NaN,NaN
997,EMP1997,SALES,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.580822
998,EMP998,FINANCE,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.764384
999,EMP1999,IT,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN

# 12

In [151]:
invalid_mask = df['salary'].isna() | (df['salary'] <= 0)

result = (
    df.assign(invalid=invalid_mask)
      .groupby('department')['invalid']
      .mean()          # gives fraction of invalid values
      .loc[lambda s: s > 0.25]   # keep > 25%
)
result

department
FINANCE    0.251908
SALES      0.261411
Name: invalid, dtype: float64

# 13

In [152]:
medsal=df['salary'].median()
flag=df[(df['performance_rating']>=4) & (df['salary']<medsal)]
medsal
flag

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years
8,EMP1008,FINANCE,Analyst,150.0,35000.0,2021-07-15,NaT,NaN,5.0,True,4.580822
21,NAN,HR,Senior Analyst,45.0,55000.0,NaT,NaT,10.0,4.0,True,NaN
26,NAN,FINANCE,Senior Analyst,28.0,75000.0,2019-05-10,NaT,8.0,5.0,True,6.764384
29,NAN,FINANCE,Manager,28.0,55000.0,2019-05-10,NaT,10.0,4.0,True,6.764384
31,NAN,HR,Analyst,NaN,55000.0,2020-06-10,NaT,1.0,4.0,NaN,5.676712
...,...,...,...,...,...,...,...,...,...,...,...
946,NAN,IT,Senior Analyst,45.0,35000.0,2019-05-10,NaT,8.0,5.0,NaN,6.764384
964,NAN,IT,Analyst,45.0,55000.0,2021-07-15,NaT,NaN,4.0,False,4.580822
988,EMP1988,FINANCE,Analyst,35.0,55000.0,NaT,2021-04-01,NaN,5.0,NaN,NaN
995,EMP1995,FINANCE,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.764384
999,EMP1999,IT,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN

# 14

In [153]:
df[(df['last_promotion_date'].isna()) & (df['performance_rating']>=4)]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years
2,EMP1002,SALES,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,NaN,NaN
8,EMP1008,FINANCE,Analyst,150.0,35000.0,2021-07-15,NaT,NaN,5.0,True,4.580822
11,NAN,SALES,Manager,22.0,250000.0,2021-07-15,NaT,NaN,5.0,True,4.580822
19,NAN,IT,Manager,22.0,120000.0,NaT,NaT,10.0,4.0,True,NaN
20,EMP1020,IT,Manager,22.0,85000.0,NaT,NaT,3.0,4.0,True,NaN
...,...,...,...,...,...,...,...,...,...,...,...
992,EMP1992,SALES,Analyst,45.0,120000.0,NaT,NaT,1.0,5.0,False,NaN
995,EMP1995,FINANCE,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.764384
996,EMP1996,IT,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,NaN,NaN
997,EMP1997,SALES,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.580822
999,EMP1999,IT,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN